EA/src/Catalogs/ПоставщикиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ПоставщикиКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/InformationRegisters/СоответствиеПоставщиковКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеПоставщиковКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПоставщикКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/Catalogs/ПоставщикиКонтрагентов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запись = РегистрыСведений.СоответствиеПоставщиковКонтрагентов.СоздатьМенеджерЗаписи();
		Запись.ПоставщикКонтрагента = Объект.Ссылка;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Контрагент = Запись.Контрагент;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запись = РегистрыСведений.СоответствиеПоставщиковКонтрагентов.СоздатьМенеджерЗаписи();
	Запись.ПоставщикКонтрагента = ТекущийОбъект.Ссылка;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			Запись.Удалить();
		ИначеЕсли Запись.Контрагент <> Контрагент Тогда
			Запись.Контрагент = Контрагент;
			Запись.Записать();
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Запись.ПоставщикКонтрагента = ТекущийОбъект.Ссылка;
			Запись.Контрагент = Контрагент;
			Запись.Записать();
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти
